package com.company.tasks1;
//Написать программу которая будет печатать/выводить следующий текст:
//
//        ____888888____________________________
//        ____88888888___________________________
//        ___8888888888__________________________
//        __888888888888_________________________
//        __8888111188888________________________
//        _888881111188888___11__________________
//        _8888811111188888_11___________________
//        _8888811111188888_11___________________
//        _8888811111118888_11___________________
//        _8888881111118888_11___11__8888888_____
//        _8888881111118888__1__11__88888888888__
//        _8888888111111888____11__8888888888888_
//        __888888111111888_111___88888888888888_
//        __8888888111118881111__888881111118888_
//        ___888888811188881111_8888811111111888_
//        ____8888888188881111188888111111118888_
//        _____88888888888111118888111111118888__
//        ______888888888111118888811111188888___
//        ______8888888881111188888888888888_____
//        _____888888888811111888888888888_______
//        ____88888888888111118888888888_________
//        ___88881111888811111888888888___________
//        __8888111111888111118888888888__________
//        _888881111118881111188811118888_________
//        _8888881111888811111881111118888________
//        _8888888118888811111888111188888________
//        __888888888888_1111888881188888_________
//        ___8888888888___111_8888888888__________
//        ____88888888_____1___88888888___________
//        _____888888___________888888____________
//        _______________________8888_____________
public class Zadacha2 {
    public static void main(String[] args) {
//        System.out.println(Minus(4) + Eight(6) + Minus(28));
        Minus(4);
        Eight(6);
        Minus(28);
        System.out.println();
        Minus(4);
        Eight(8);
        Minus(28 - 2);
        System.out.println();
        Minus(4 - 1);
        Eight(8 + 2);
        Minus(28 - 3);
        System.out.println();
        Minus(4 - 2);
        Eight(8 + 4);
        Minus(28 - 4);
        System.out.println();
        Minus(4 - 2);
        Eight(4);
        One(4);
        Eight(5);
        Minus(28 - 5);
        System.out.println();
        Minus(1);
        Eight(5);
        One(5);
        Eight(5);
        Minus(3);
        One(2);
        Minus(17);
        System.out.println();
        Minus(1);
        Eight(5);
        One(6);
        Eight(5);
        Minus(1);
        One(2);
        Minus(18);
        System.out.println();
        Minus(1);
        Eight(5);
        One(6);
        Eight(5);
        Minus(1);
        One(2);
        Minus(18);
        System.out.println();
        Minus(1);
        Eight(5);
        One(6);
        Eight(5);
        Minus(1);
        One(2);
        Minus(18);
        System.out.println();
        Minus(1);
        Eight(5);
        One(6);
        Eight(5);
        Minus(1);
        One(2);
        Minus(3);
        One(2);
        Minus(2);
        Eight(7);
        Minus(4);
    }
    public static void Minus(int minus){
        for (int i = 0; i < minus; i++) {
            String a = "_";
            System.out.print(a);
        }
    }
    public static void Eight(int eight){
        for (int i = 0; i < eight; i++) {
            int a = 8;
            System.out.print(a);
        }
    }
    public static void One(int one){
        for (int i = 0; i < one; i++) {
            int a = 1;
            System.out.print(a);
        }
    }

}
