package com.company.tasks1;
//Написать программу которая будет печатать/выводить следующий текст:
//
//        3
//        2
//        1
//        Поехали!!!
public class Zadacha1 {
    public static void main(String[] args) {
        int a = 3;
        int b = 2;
        System.out.println(a);
        System.out.println(b);
        System.out.println(a - b);
        System.out.println("Paehali!!!");
    }
}
