package tasks2;
//Необходимо создать целочисленные переменные a и b, присвоить произвольные значения переменным на
//        ваш выбор и вывести результаты следующих операций с этими переменными: сложение, умножение,
//        вычитание, деление и остаток от деления. Так же сделать проверку на четность этих переменных и
//        вывести результат.
//        Экстра задача
//        Вывести/напечатать смайлик (не :), а настоящий смайлик одним символом).
public class Zadacha1 {
    public static void main(String[] args) {
        int a = 10;
        int b = 3;

        System.out.println((double) a / b);
        System.out.println(a * b);
        System.out.println(a - b);
        System.out.println(a + b);

    }
}
